bog_app/app/controllers/creatures_controller.rb

INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Boogey"], ["description", "Oogey Boogey"], ["created_at", 2016-10-02 23:19:13 UTC], ["updated_at", 2016-10-02 23:19:13 UTC]]
---
  def create
    creature_params = params.require(:creature).permit(:name, :description)

    creature = Creature.new(creature_params)

    if creature.save